tap "buildkite/buildkite"
tap "fastly/tap"
brew "awscli"
brew "awscli-local"
brew "basictex"
brew "buildkite/buildkite/bk@3"
brew "chamber"
brew "cmake"
brew "corepack"
brew "coreutils"
brew "composer"
brew "direnv"
brew "duti"
brew "duckdb"
brew "fastly/tap/fastly"
brew "fd"
brew "fzf"
brew "gh"
brew "gawk"
brew "gsed"
brew "grep"
brew "htop"
brew "httpie"
brew "jq"
brew "luarocks"
brew "mkcert"
brew "mysql-client"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "php@8.3", link: true
brew "poetry"
brew "postgresql@18"
brew "prettier"
brew "python"
brew "rg"
brew "sql-formatter"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "typescript"
brew "uv"
brew "watch"
brew "wget"
cask "1password"
cask "1password-cli"
cask "aws-vault-binary"
cask "font-comic-mono"
cask "ghostty"
cask "orbstack"
cask "rectangle"

brew "bash-language-server"
brew "dockerfile-language-server"
brew "lua-language-server"
brew "pyright"
brew "shellcheck"
brew "shfmt"
brew "sql-language-server"
brew "stylua"
brew "typescript-language-server"
brew "yaml-language-server"
